/**********************软件延时************************
*  晶振:11.0592MHZ
******************************************************************/   
#ifndef __SOFTTIMER_H_
#define __SOFTTIMER_H_

//====================================================================//
// 实现功能： 5毫秒延时子程序
// 参    数：无
// 返 回 值：无
//====================================================================//
void Delay1ms(unsigned int i); 
void Delay10us(unsigned char i) ;

//********************************************************** 
//函数名称:Delay1ms(unsigned int i) 
//函数功能:延时i*1ms的子程序(对应于22.1184Mhz晶振)   
//形式参数:unsigned int i 
//行参说明:无 
//返回参数:无 
//使用说明:i为要延时的时间长度，单位是MS，最大可以延时65536 ms 
//********************************************************** 
void Delay1ms(unsigned int i)   //误差 -0.651041666667us
{
    unsigned char a,b;
	for(i;i>0;i--)
    	for(b=102;b>0;b--)
        	for(a=3;a>0;a--);
} 
//********************************************************** 
//函数名称:Delay10us(unsigned char i) 
//函数功能:延时i*10us的子程序(对应于22.1184Mhz晶振)   
//形式参数:无 
//行参说明:无 
//返回参数:无 
//使用说明:i为要延时的时间长度，单位是US，最大可以延时250 ms 
//********************************************************** 
void Delay10us(unsigned char i)   //误差 -0.234375us
{
    unsigned char a;
	for(i;i>0;i--)
    	for(a=3;a>0;a--);
}
#endif